import { Component } from '@angular/core';


/*
  Generated class for the WeatherPage page.

  See http://ionicframework.com/docs/v2/components/#navigation for more info on
  Ionic pages and navigation.
*/
@Component({
  templateUrl: 'page2.html',
})
export class Page2 {
  items = [];

  constructor() {

    this.items = [
      {
        'title': 'ООО «КенигТрансАвто»',
        'rout': '105,106,107,108,120,140,144',
        'call': '23-45-05'
      }, {
        'title': 'ООО «КенигТрансАвто 2»',
        'rout': '514, 514к, 524, 523, 543, 544',
        'call': '23-45-05'
      },
      {
        'title': 'ООО «Тотем 5»',
        'rout': '109,116,127,137,345,110,114,141',
        'call': '53-36-70'
      },
      {
        'title': 'ООО «Гурьевские линии 1»',
        'rout': '103,115,145',
        'call': '74-11-89'
      },
      {
        'title': 'ООО «Соната - Транс»',
        'rout': '112,134,155',
        'call': '39-18-33'
      },
      {
        'title': 'ООО «Зеленоградск Транс 1»',
        'rout': '111,114,118,119,125,141',
        'call': '58-89-57'
      },
      {
        'title': 'ООО «Тотем 6»',
        'rout': '158,159',
        'call': '93-04-85'
      },
      {
        'title': 'ООО «Зеленоградск Транс»',
        'rout': '113,133,148,593',
        'call': '58-89-57'
      },
      {
        'title': 'ООО «Зеленоградск Транс 3»',
        'rout': '117, 191',
        'call': '58-89-57'
      },
      {
        'title': 'ООО «Светлогорскавто 1»',
        'rout': '118',
        'call': '8-40-153-2-20-51'
      },
      {
        'title': 'ООО «Тотем интернешинл»',
        'rout': '152,534',
        'call': '53-57-72'
      },
      {
        'title': 'ООО «БалтАвтоЛайн»',
        'rout': '162',
        'call': '93-79-01'
      },
      {
        'title': 'ЗАО «Балтийский пилигрим»',
        'rout': '136',
        'call': '64-15-25'
      },
      {
        'title': 'ООО «Гвардейскавто»',
        'rout': '341,156',
        'call': '8-40-159-3-22-34'
      },
      {
        'title': 'ООО «БалтТрансАвто»',
        'rout': '121,509,527, 567, 520',
        'call': '63-11-35'
      },
      {
        'title': 'ООО «Евролайн»',
        'rout': '513,522',
        'call': '58-89-57'
      },
      {
        'title': 'ООО «Светлогорскавто 1»',
        'rout': '536к',
        'call': '8-40-153-2-20-51'
      },
      {
        'title': 'ООО «Тотем 1»',
        'rout': '173',
        'call': '53-57-72'
      },
      {
        'title': 'ООО «Евролайн 1»',
        'rout': '515,516,525,526',
        'call': '53-36-70'
      },
      {
        'title': 'МУП «ОзерскАвто»',
        'rout': '554',
        'call': '8-40-142-3-32-18'
      },
      {
        'title': 'ОАО «Автоколонна 1802»',
        'rout': '566,580,582',
        'call': '8-40-143-3-35-43'
      },
      {
        'title': 'ООО «ГусевАвтоТранс»',
        'rout': '570',
        'call': '8-40-143-3-35-43'
      },
      {
        'title': 'ООО «Гусевские линии»',
        'rout': '540, 581, 583',
        'call': '8-40-143-3-35-43'
      },
    ]

  }

}


